#+BEGIN_SRC graphql :url http://127.0.0.1:5000/graphql
{
               bikes(first: 2, type: "Gravel"){
                   edges {
                   node {
                       name
                       brand
                       year
                       size
                       wheelSize
                       type
                       }
                   }
               }
           }
#+END_SRC

#+RESULTS:
#+begin_example
{
  "data": {
    "bikes": {
      "edges": [
        {
          "node": {
            "name": "CAADX ULTEGRA",
            "brand": "Cannondale",
            "year": "2019",
            "size": [
              "46",
              "51",
              "54",
              "58"
            ],
            "wheelSize": 28.0,
            "type": "Gravel"
          }
        }
      ]
    }
  }
}
#+end_example
